{"timestamp":1741372717734,"data":{"success":true,"data":{"title":"Men Black Pure Cotton Casual Shirt","brand":"Roadster","price":"559","description":"RoadsterMen Black Pure Cotton Casual Shirt4.2|46.1k Ratings₹559Price DetailsMaximum Retail PriceRs. 999(Incl. of all taxes)Discount44% OFFSelling PriceRs. 559(Incl. of all taxes)MRP ₹999(44% OFF)inclusive of all taxesSELECT SIZE Size Chart38HideGarment Measurement:Chest - 38.0inRegular FitThe model (height 6) is wearing a size 4040HideGarment Measurement:Chest - 42.0inRegular FitThe model (height 6) is wearing a size 4042HideGarment Measurement:Chest - 45.0inRegular FitThe model (height 6) is wearing a size 4044HideGarment Measurement:Chest - 48.0inRegular FitThe model (height 6) is wearing a size 4046HideGarment Measurement:Chest - 51.25inRegular FitThe model (height 6) is wearing a size 40ADD TO BAGWISHLISTDelivery Options Please enter PIN code to check delivery time & Pay on Delivery Availability100% Original ProductsPay on delivery might be availableEasy 14 days returns and exchangesBEST OFFERS Best Price: Rs. 409Applicable on: Orders above Rs. 199 (only on first purchase)Coupon code: MYNTRAHALFPRICECoupon Discount:  50%  off (Your total saving: Rs. 590)View Eligible Products10% Discount on Axis Bank Credit Card.Min Spend ₹3500, Max Discount ₹1000.Terms & Condition10% Discount on Kotak Credit and Debit Cards.Min Spend ₹3500, Max Discount ₹1000.Terms & Condition10% Discount on SBI Debit Cards.Min Spend ₹3500, Max Discount ₹1000.Terms & Condition10% Discount on Axis Bank Credit Card EMI.Min Spend ₹3500, Max Discount ₹1500.Terms & Condition10% Discount on Kotak Credit and Debit Card EMI.Min Spend ₹3500, Max Discount ₹1500.Terms & Condition10% Discount on HDFC Bank Credit Card EMI.Min Spend ₹3500, Max Discount ₹1000.Terms & Condition12.5% Discount on Myntra Kotak Credit Card.Max Discount up to ₹750 on every spends.Terms & ConditionEMI option availableEMI starting from Rs.27/monthView PlanProduct DetailsProduct Details Black solid casual shirt, has a spread collar, button placket, 1 pocket, long sleeves, curved hemSize & FitRegular FitThe model (height 6) is wearing a size 40Material & Care100% cottonMachine-washSpecificationsSleeve LengthLong SleevesCollarSpread CollarFitRegular FitPrint or Pattern TypeSolidOccasionCasualLengthRegularHemlineCurvedPlacketButton PlacketSee MoreRatings4.246.1k Verified Buyers525772411399344192154012988What Customers SaidFitJust Right (75%)LengthJust Right (83%)View DetailsCustomer Photos (801)Customer Reviews (6674)5Sure! Here’s a general review template for printed shirts:\n\n---\n\n**Review for Printed Shirts**\n\nI recently purchased a few printed shirts, and I'm quite impressed with the overall quality. \n\n**Design:** The prints are vibrant and eye-catching, with clear details that stand out. There’s a good variety of styles, so there’s something for everyone.\n\n**Material:** The fabric feels soft and comfortable against the skin, and it’s breathable, making it perfect for casual wear. \n\n**Fit:** The sizing is true to size, providing a flattering silhouette without being too tight or too loose.\n\n**Durability:** After several washes, the prints have held up well without fading or cracking, which is a huge plus.\n\n**Value for Money:** Considering the quality and design, these shirts are reasonably priced. \n\n**Overall:** I would highly recommend these printed shirts for anyone looking to add a fun touch to their wardrobe.\n\n---Mit31 Oct 2024005Here’s a review for the Roadster Black Shirt:\n\n\n---\n\nProduct: Roadster Black Shirt\nComfort: ⭐⭐⭐⭐\nStyle: ⭐⭐⭐⭐⭐\nFit: ⭐⭐⭐⭐⭐\nFabric Quality: ⭐⭐⭐⭐\nPrice: ⭐⭐⭐⭐\n\nI recently bought the Roadster black shirt, and it’s quickly become one of my go-to choices for both casual and semi-formal occasions. The shirt’s design is simple yet stylish, giving off a rugged, classic vibe. It pairs well with jeans or chinos, making it quite versatile.\n\nIn terms of comfort, the fabric is lightweight and breathable, which makes it comfortable for all-day wear. It doesn’t feel too heavy or stiff, and it moves well with the body. The fit is true to size, with a slim but not too tight silhouette, which makes it flattering for a range of body types.\n After several washes, the color has held up well, and there hasn’t been any noticeable fading.\n\n\nAviral Shukla26 Sept 2024215I've been using the Myntra app for a while now and I'm extremely satisfied with my shopping experience. The app is user-friendly and offers a wide variety of products across different categories. The filters and search options make it easy to find exactly what I'm looking for. \nRecently, I ordered a shirt and it arrived in perfect condition, exactly as described. The quality of the fabric is excellent, and the fit is perfect. Delivery was prompt and the packaging was secure. The return and exchange process is also hassle-free, which is a huge plus.\nOverall, Myntra provides great value for money and exceptional customer service. I highly recommend this app to anyone looking for a convenient and reliable online shopping experience.Vipul Kumar2 Aug 202421View all 6674 reviewsProduct Code: 2127876Seller: AMBA GARMENTS PRIVATE LIMITED - SJIT View Supplier Information","images":["https://assets.myntassets.com/h_720,q_90,w_540/v1/assets/images/2127876/2017/11/23/11511431472633-Roadster-Men-Black-Regular-Fit-Solid-Casual-Shirt-8801511431472500-1.jpg","https://assets.myntassets.com/h_720,q_90,w_540/v1/assets/images/2127876/2017/11/23/11511431472614-Roadster-Men-Black-Regular-Fit-Solid-Casual-Shirt-8801511431472500-2.jpg","https://assets.myntassets.com/h_720,q_90,w_540/v1/assets/images/2127876/2017/11/23/11511431472596-Roadster-Men-Black-Regular-Fit-Solid-Casual-Shirt-8801511431472500-3.jpg","https://assets.myntassets.com/h_720,q_90,w_540/v1/assets/images/2127876/2017/11/23/11511431472584-Roadster-Men-Black-Regular-Fit-Solid-Casual-Shirt-8801511431472500-4.jpg"],"availability":"in_stock","availableSizes":["38","40","42","44","46"]}}}